{
  "title": "2025 테오콘(TEOConf) 참가 후기",
  "date": "2025-12-27T12:29:14.398Z",
  "content": "## 1. 들어가며\n2025년 테오의 컨퍼런스(테오콘)에 참가했다. 이 글에서 테오콘에 참여하게된 계기와 참여 후기에 대해 적어보려 한다.\n\n## 2. 테오콘에 참여하게 된 이유\n부트캠프에 다니던 시절, **'테오의 스프린트'** 에 대해 알게 됐다.\n테오의 스프린트는 6일 정도 짧은 기간 동안 아이디어 도출부터 팀 매칭, 프로젝트 개발, 완성까지 수행하는 프로그램이다.\n현업에 계시는 개발자, 디자이너 분들도 많이 참여하신다고 들어, 협업 경험을 위해 참가를 신청했다.\n\n![](https://velog.velcdn.com/images/rookieand/post/15a1d829-9ff1-48cb-a02b-498a7834f506/image.png)\n\n하지만 스프린트 예정일이 다가오고 있을 당시, 진행하던 개인 프로젝트 의욕도 함께 불타오르고 있던 때라 스프린트에 참가하지 않고 개인 프로젝트를 마무리하는데 더 집중하기로 마음을 바꿨다.\n\n이때 스프린트는 참여하지 않았지만, **'테오의 프론트엔드'** 라는 디스코드 채널에 들어가게 되었다.\n\n디스코드 채널에 올라온 글들을 꾸준히 읽어 나갔다. '내가만들었어요'에서 다른 분들이 만든 프로젝트를 보고, '개발자유머'에 테오가 올리는 개발자들이 공감할 수 있는 이미지를 보기도 했다. 그 채널에서 테오콘에 대해 알게 됐다.\n\n**'모두에게 열려있는 컨퍼런스'** 라는 컨셉을 목표로 시작된 테오콘은 서로가 갖고 있는 경험과 지식을 공유하고 개발자들간에 소통하는 시간을 만들기 위해 시작되었다고 한다.\n\n개발자로 취업을 하고, 회사 사람들과 대학교 동기 외에 다른 **개발자**를 만날 일은 거의 없었다. 어차피 회사 가면, 친구를 만나면 개발자들인데, 굳이 찾아서 만나야 해..?🤨 그런 생각이 깔려 있었다.\n\n그러다 올해 10월에 회사를 그만두고 이직 준비를 하게 됐다. 이직할 회사가 정해지면 다니던 회사를 그만 둘 생각이었는데, 어느 순간부터 회의감이 들었다.\n\n회사에 재직할 당시, Django를 이용해 백엔드 개발을 하고 있었는데, 프론트엔드 개발자가 되고 싶다는 마음이 커지고 있었다.\n\n![](https://velog.velcdn.com/images/qhgus/post/a760b541-bb25-4ac0-a600-c3d153d5a2da/image.png)\n\n**백엔드 경력이 아무리 쌓여도, 프론트엔드 경력으로 이어질 수 있을까?** 의문이 들었다.\nDjango 개발을 했다고, React를 했다고 말할 수 없는 것처럼.\n백엔드 로직을 아무리 많이 짜도, 결국 내가 하고 싶었던 프론트 개발과는 거리가 있었다.\n\n그럼 왜 처음부터 프론트를 가지 않았는지는,\n나중에 '이직을 결심한 계기'로 글을 쓸 때 더 이야기해보려고 한다.\n\n아무튼. 프론트 개발을 하고 싶었고, 시간이 지날수록 새로운 도전에 대한 용기가 작아졌다.\n\n그래서 회사에서 맡았던 프로젝트가 서비스를 시작하고, 어느 정도 안정화 단계에 접어 들었을 때, 지금이 그만둬야 할 때라고 판단하게 되었다. 그렇게 1년 8개월 정도의 기간 동안 몸 담았던 첫 직장을 그만두고, 백수가 되었다.\n\n![](https://mblogthumb-phinf.pstatic.net/MjAyMjA2MDhfNTcg/MDAxNjU0Njk0ODM2OTMw.M_3ZhkGuct7H2fAfByJ5bsFEbey_6Q1BBbOSpy8c4mIg.ujCW7RvxSfaYU44Dyh1AUfSFZjUG_ehT4C4vyPBJ6U4g.JPEG.s016421/IMG_9830.JPG?type=w800)\n\n일을 그만 두고, 프론트엔드 개발자로 포트폴리오와 이력서를 다시 준비했다.\n개인 프로젝트로 Next.js를 이용해 블로그도 만들어 보고, React와 Next.js 공식문서를 보며 몰랐던 부분을 채워나갔다.\n\n그러다 디스코드 채널에서 테오의 컨퍼런스가 12월에 열린다는 소식을 들었다. 다른 프론트엔드 개발자들을 만나서 어떻게 취업을 준비했는지 경험을 듣고 싶었다. 특히 '테오의 고민 상담소' 코너가 있었는데, 테오에게 궁금한 점을 물어보고 싶기도 했다.\n\n![](https://velog.velcdn.com/images/dldnjssh123/post/462a5d9c-ab98-4026-865d-d4e175f2ec7b/image.jpg)\n\n\n서론이 길었지만, 테오콘에 참가 신청을 하게 되었고, 운 좋게 당첨되어 12월 6일 TRACK B로 참가하게 되었다.\n\n\n## 3. 팀 빌딩 및 네트워킹 시간\n\n테오콘이 열리는 성수 앨리스Lab에 도착하자, 스태프분들이 참자가들에게 명찰과 선물을 주셨다. \n테오콘 로고가 들어간 볼펜, 키캡 키링, 스티커 등이 들어있었는데, 명함이 가장 눈에 띄었다.\n\n명함에는 테오콘을 신청할 때 적었던 닉네임과 이름, Github 주소, 소개 문구가 적혀 있었다.\n\n![](https://velog.velcdn.com/images/dldnjssh123/post/01e96e97-cbe0-4a17-9823-1345e55af6ab/image.jpeg)\n\n분명 참가비가 무료였는데 이렇게 많이 주셔도 되나..? 🥹\n싶을 정도로 신경을 많이 써주신 게 보여서 고맙고, 또 기대가 되었다.\n\n선물을 받고 TRACK 별로 지정된 장소로 갔다. 팀 별로 자리가 나뉘어져 있어서, 내가 배정 받은 자리로 가자 먼저 오신 한 분이 앉아 계셨다.\n\n처음에는 어색해서 인사만 주고 받고 노트북만 봤는데, 스태프분이 와서 말문을 터주셨다.\n알고 보니 먼저 와 계신 분은, 오늘 B트랙에서 마지막으로 발표를 하시는 minu님이었다.\n\n시간이 조금 더 지나자 다른 팀원분들도 오셨고, 자기소개 후 팀미션(?)이 진행되었다.\n\n스파게티면 + 마시멜로우를 이용해 구조물 쌓아올리는 미션이 주어졌다.\n주어진 시간이 많지 않아서, 각자 하나의 컴포넌트를 만들듯 정사면체를 만들고 나중에 붙이기로 했다.\n\n손재주가 없던 내가 가장 느렸던 것 같은데, 다른 팀원들의 빠른 속도 덕분에 우리팀은 가장 높게 쌓아올려서 1등을 하게 됐다. 1등 상품으로 빼빼로를 받았다!\n\n그렇게 팀원들과 조금씩 말문을 트고,\n어떻게 테오콘에 참여하게 되었는지, 어떤 일을 하고 있는지 이야기를 나누며 세션시간을 기다리게 되었다.\n\n## 4. TRACK B 세션을 듣고\n\n네트워킹 시간이 끝나고 본격적으로 시작된 세션타임.\n\nTRACK B에는 세 명의 발표가 준비되어있었다.\n\n세 명 모두 호기심을 자극하는 주제였는데, 당근마켓에서 **'프론트엔드 인턴 생활 중, 백엔드 개발 경험'** 에 대한 이야기를 준비하신 링커님과 **'그래프로 풀어본 복잡한 권한 관리'** 에 대한 이야기를 준비하신 여권님, **'10만명 사용자 게임의 아이디어부터 배포, 배포 이후까지의 과정'** 에 대한 이야기를 준비하신 minu님까지.\n\n✨ 트랙에 대한 자세한 내용은 아래 링크에서 확인할 수 있다.\nhttps://www.teoconf.com/\n\n특히 '스트리머 vs 시청자, 집단지성 오목게임'을 만든 minu님의 발표가 인상적이었는데, **10만명이 즐겼지만, 서버비용은 0원** 이라는 말이 눈길을 끌었다. 개발 과정에서 당면할 수 밖에 없는 '운영 비용'에 대한 고민을 엿볼 수 있었는데, 나 역시 만들고 싶은 서비스가 있고, 어떻게 하면 비용을 절약할 수 있을까 고민해왔기 때문에 더 눈을 반짝이며 듣게 되었다.\n\n## 5. 테오의 고민 상담소\n\n모든 발표가 끝나고, 잠시 쉬는 시간을 가졌다가 '테오의 고민 상담소' 시간이 됐다.\n테오콘을 신청할 때 질문을 적었는데, 테오가 직접 와서 답변을 해줬다.\n질문이 많아서 몇 개만 뽑아서 하는 줄 알았는데, 모든 참가자의 질문에 답변을 해줬다.\n\n내 질문에 대한 답도 들을 수 있었다.\n내가 어떤 질문을 했고, 테오가 어떤 답변을 했는지 밝히진 않겠다.\n다만, 테오의 답변을 통해 더 구체적으로 내가 나아갈 방향을 정해야 겠다고 생각했다.\n\n프론트엔드 개발자가 되고 싶기도 하지만, 나는 분명 가고 싶은 회사가 있다.\n그런데 정작, 회사의 프론트엔드 개발자가 어떤 일을 하는지, 깊게 알아보진 않았다.\n\n채용 공고를 보면, **자격사항**과 **우대사항**을 보여준다.\n지금까지 난 자격사항만 봐왔던 것 같다.\n\n'우대사항은 우대해주는 것 뿐이니까, 회사에 들어가면 어떻게든 배우게 되지 않겠어?'\n\n그런 생각을 가지고 있었다.\n회사마다 우대사항은 다 다르고, 내가 그걸 모두 개발에 이용하고 학습할 수는 없었으니까.\n\n하지만 내가 정말로 가고 싶은 곳이라면, 해보는 게 맞지 않을까?\n회사에서 경력직을 원한다는 건, **바로 일할 사람**을 원한다는 말이기도 하다.\n기본(JS, React, Next.js 등)만 쌓고, 나머지는 회사에 들어가 배울 생각한 내가 부끄러워지는 시간이었다.\n\n## 6. 마무리\n\n꽤 흥미로운 시간이었다.\n개발자들과 소통하며 일하고 있지만, 마음 편하게 서로의 관심에 대해 이야기하고, 공유할 수 있는 시간은 흔치 않았다.\n\n또 자극도 됐다. 나름 열심히 살고 있지 않나 생각했는데, 참가하신분들 대부분은 나보다 개발에 대한 지식이 더 깊고, 넓었다. 더 열심히 개발하고, 그걸 즐기는 분들을 보면서 나도 그들처럼 되고 싶다고 생각했고, 언젠간 동료로 만났으면 좋겠다는 생각을 했다.\n\n좋은 시간 준비해주신 테오와 스태프 분들께 감사하다.\n\n아래는 이번 테오콘에서 받은 것들이다. 빈손으로 갔는데 너무 많은 걸 받아왔다.\n\n![](https://velog.velcdn.com/images/dldnjssh123/post/1cd717e4-45e6-451a-b1d1-1d3cb06f30a3/image.jpeg)\n\n(팀미션에서 받은 빼빼로, 럭키드로우에 당첨되어 받은 텀블러, 팀원에게 선물 받은 후레쉬베리 꾸미기 세트, 참가 선물로 받은 볼펜, 스티커, 메모장, 명함, 명찰, 키보드 키링)\n\n현장 사진을 찍어뒀으면 좋았을 텐데, 미처 찍을 생각을 못했다.\n\n![](https://velog.velcdn.com/images/dldnjssh123/post/94c17206-c51a-4e9c-87f0-3d08633ec787/image.jpeg)\n\n\n후레쉬베리 꾸미기 세트는 선물 증정식 때 발표를 하셨던 minu 님께 받았다. 나는 다이어리를 준비해 갔는데, 다들 재밌는 선물을 가지고 오셨었다.\n\n![](https://image.blip.kr/v1/file/0bd645d71c60b1bcb2d44055ba379090)\n\n내가 그리고 싶었던 농담곰.\n\n![](https://velog.velcdn.com/images/dldnjssh123/post/dd262336-9438-4e3f-a8eb-e173eee75a47/image.jpeg)\n\n그리고 결과...\n\n나름 선물 받은 거라고 꾸며봤는데, 쉽지 않았다. 나머지는 그냥 먹도록 해야겠다. \n\n\n"
}